app/views/home/index.html.haml

SELECT "posts".* FROM "posts" ORDER BY created_at desc
---

            = form_for @contact, html:{id: 'contact-form', method: 'post', onsubmit: "this.submit.value='Enviando...';this.submit.disabled = true;"}, url: '/contact', remote: true do |c|