app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at desc
---
  def index
    @title = '2º Encontro Norte Capixaba de Tecnologia'
    @posts = Post.order('created_at desc')