app/controllers/posts_controller.rb

  def index
    @title = 'II ENCATEC - Posts'
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    @title = 'II ENCATEC - Posts'
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @title = 'II ENCATEC - Posts'
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @title = 'II ENCATEC - Posts'
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Testando"], ["created_at", Fri, 05 Apr 2013 13:54:34 BRT -03:00], ["title", "Teste"], ["updated_at", Fri, 05 Apr 2013 13:54:34 BRT -03:00]]